---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsForHooksEnabled
source: html/4c49bf38-1e61-a4fe-ebda-fd05e3b90e63.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsForHooksEnabled Property

Identifies if the angular dimensions which has a reference set on a hook will be shown or not.

## Syntax (C#)
```csharp
public bool AngularDimensionsForHooksEnabled { get; set; }
```